Revit 2027 API
RadioButtonGroup.AddItems Method
Adds new ToggleButtons to the RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ToggleButton> AddItems(
	IList<ToggleButtonData> buttonData
)
Public Function AddItems (
	buttonData As IList(Of ToggleButtonData)
) As IList(Of ToggleButton)
public:
IList<ToggleButton^>^ AddItems(
	IList<ToggleButtonData^>^ buttonData
)
member AddItems :
        buttonData : IList<ToggleButtonData> -> IList<ToggleButton>
Parameters
buttonData IList<ToggleButtonData>
A list of objects containing the data needed to construct the ToggleButtons.
Return Value
IList<ToggleButton>
 The newly added ToggleButtons.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when buttonData is null.
ArgumentException |  Thrown when button with buttonData.Name already exists in the group.
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace